/**
 * Задача №2 - Разная комиссия
 * В прошлый раз мы рассматривали упрощённый вариант вычисления комиссии. Пришла пора сделать нормальный.
 *
 * Q: Почему?
 *
 * A: Потому что так дешевле пользователям. За MasterCard и Maestro вообще не нужно платить пока
 * не превысили лимит (замечание от 300 убираем), а для VK Pay всегда бесплатно.
 * Напишите алгоритм расчёта в виде функции, передавая в функцию:
 *
 * Тип карты/счёта (по умолчанию - Vk Pay).
 * Сумму предыдущих переводов в этом месяце (по умолчанию - 0).
 * Сумму совершаемого перевода.
 * Функция по-прежнему должна возвращать комиссию в копейках.
 *
 * Итог: у вас должен быть репозиторий на GitHub, в котором будет ваш Gradle-проект.
 */

fun main() {

}