package ru.netology

/**Задача №2 - "Люди/Человеки"
 * Русский язык в интерфейсах - достаточно сложная штука, потому что нам постоянно
 * приходится изменять окончания слов после числительных:
 * Вам нужно провести самостоятельный анализ (да-да, к этому нужно привыкать, не всегда вам дадут чёткую постановку
 * задачи, достаточно часто вы будете получать задачу в формате «Сделай как в Вк») и написать небольшое приложение:
 * В переменной likes хранится число лайков.
 * Приложение выводит в консоль соответствующий вариант, вы сами должны их определить, в зависимости от того,
 * что хранится в [likes]
 * Итог: у вас должен быть репозиторий на GitHub, в котором расположен ваш Gradle-проект.
 */

val likes = 411

fun main() {
    println("Понравилось $likes человек${endingWordLikes(likes)}")
}

fun endingWordLikes(likes: Int): String {
    val lastNumber = likes % 10
    return if (lastNumber == 1) "у"
    else if (lastNumber >= 2  || lastNumber == 0) "ам"
    else ""
}