package ru.netology

/**Задача №2 - "Люди/Человеки"
 * Русский язык в интерфейсах - достаточно сложная штука, потому что нам постоянно
 * приходится изменять окончания слов после числительных:
 * Вам нужно провести самостоятельный анализ (да-да, к этому нужно привыкать, не всегда вам дадут чёткую постановку
 * задачи, достаточно часто вы будете получать задачу в формате «Сделай как в Вк») и написать небольшое приложение:
 * В переменной likes хранится число лайков.
 * Приложение выводит в консоль соответствующий вариант, вы сами должны их определить, в зависимости от того,
 * что хранится в [likes]
 * Итог: у вас должен быть репозиторий на GitHub, в котором расположен ваш Gradle-проект.
 */

var likes = 101

fun main() {
    for (i in 1..10) {
        println("Понравилось $likes ${endingWordLikes(likes)}")
        likes++
    }
}

fun endingWordLikes(likes: Int): String {
    val lastNumberHundred = likes % 100
    val lastNumberTen = likes % 10
    return if (lastNumberHundred in 11..19) "человекам"
    else if (lastNumberTen == 1) "человеку"
    else if (lastNumberTen >= 2 || lastNumberTen == 0) "человекам"
    else ""
}